Repository: astechtic/ayuvo
Catalog: ios/calorietracker/BarcodeLookup.xcstrings
Source language: en
Languages: uk

# barcode.lookup.offline
source: You appear to be offline. Check your connection and try scanning again.
uk: Схоже, ви офлайн. Перевірте з'єднання та спробуйте сканувати ще раз.

# barcode.lookup.timeout
source: Open Food Facts took too long to respond. Try scanning again.
uk: Open Food Facts занадто довго відповідав. Спробуйте сканувати ще раз.

# barcode.lookup.invalid_barcode
source: That barcode could not be read. Try scanning it again.
uk: Не вдалося прочитати цей штрихкод. Спробуйте відсканувати його ще раз.

# barcode.lookup.invalid_response
source: Open Food Facts returned an unexpected response.
uk: Open Food Facts повернув неочікувану відповідь.

# barcode.lookup.missing_nutrition
source: This barcode was found, but nutrition data is incomplete. Scan the nutrition label instead.
uk: Штрихкод знайдено, але дані про харчову цінність неповні. Натомість відскануйте етикетку.

# barcode.lookup.network_error
source: Barcode lookup failed. Check your connection and try again.
uk: Не вдалося знайти штрихкод. Перевірте з'єднання та спробуйте знову.

# barcode.lookup.product_not_found
source: Product not found in Open Food Facts. Scan the nutrition label instead.
uk: Продукт не знайдено в Open Food Facts. Натомість відскануйте етикетку з харчовою цінністю.

# barcode.lookup.rate_limited
source: Too many barcode lookups. Wait a moment and try again.
uk: Занадто багато запитів штрихкода. Зачекайте трохи та спробуйте знову.

# barcode.lookup.service_unavailable
source: Open Food Facts is temporarily unavailable. Try again later.
uk: Open Food Facts тимчасово недоступний. Спробуйте пізніше.

# barcode.product.fallback_name
source: Barcode %@
uk: Штрихкод %⁠@
